# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/dupes'
tap 'homebrew/php/php70'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'node'
brew 'ssh-copy-id'
brew 'wget'
brew 'zsh'
brew 'mas'
brew 'imagemagick'
brew 'tmux'
brew 'mackup'

# Install Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'cleanmymac'
cask 'docker'
cask 'docker-toolbox'
cask 'google-chrome'
cask 'iterm2'
#cask 'macid'
cask 'mysqlworkbench'
cask 'mysql-utilities'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'spotify'
#cask 'sourcetree'
cask 'sublime-text3'
cask 'tower'
cask 'vagrant'
cask 'virtualbox'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
